#include <bits/stdc++.h>
#include <atcoder/all>
using namespace std;
using namespace atcoder;

/////////////////// メイン ///////////////////

int main () {

  /////////////////// 前入力 ///////////////////

  int q;
  cin >> q;

  /////////////////// 前処理 ///////////////////



  /////////////////// ループ ///////////////////

  for (int loop=0; loop<q; loop++) {

    //////////////////// 入力 ////////////////////

    int n;
    cin >> n;

    vector<int> a(n);
    for (int i=0; i<n; i++) {
      cin >> a.at(i);
    }

    //////////////// 出力変数定義 ////////////////

    string result = "Bob";

    //////////////////// 処理 ////////////////////

    // 1が連続している個数を数える変数
    int counter = 0;

    // 前から1つずつ見ていく+最後に1回のループ
    for (int i=0; i<=n; i++) {

      if (i==n||a.at(i)==0) {

        if (counter!=0&&counter!=2) {

          // 連続数が2以外のところが1つでもあったら、Aliceの勝ち
          result = "Alice";
          break;

        } else {

          // 連続数が0か2だったら、カウンターを0に戻す
          counter = 0;

        }

      } else {

        // カウンターを増やす
        counter++;

      }
    }

    //////////////////// 出力 ////////////////////

    cout << result << endl;

  }

  /////////////////// 後処理 ///////////////////



  //////////////////// 終了 ////////////////////

  return 0;

}