#include <bits/stdc++.h>
#include <atcoder/all>
using namespace std;
using namespace atcoder;

/////////////////// メイン ///////////////////

int main () {
  
  /////////////////// 前入力 ///////////////////
  
  int q;
  cin >> q;

  /////////////////// 前処理 ///////////////////



  /////////////////// ループ ///////////////////

  for (int loop=0; loop<q; loop++) {
    
    //////////////////// 入力 ////////////////////

    long long a, b, x, y;
    cin >> a >> b >> x >> y;

    //////////////// 出力変数定義 ////////////////

    long long result = 0;

    //////////////////// 処理 ////////////////////

    // xとyの符号は無関係なので、非負の数にしておく
    x = abs(x);
    y = abs(y);

    // x<yだったら、縦横入れ替える
    if (x<y) {
      swap(x,y);
      swap(a,b);
    }

    // xもyも目的とずれている場合、まず斜め45度に移動する経路が必ずある
    // それを何回繰り返すか考えてまとめて処理
    int t = min(x,y);
    result += 2*t*min(a,b);
    x -= t;
    y -= t;

    // 偶数→奇数はmin(a,3b)、奇数→偶数はmin(b,3a)かかる
    // それぞれを何回繰り返すか考えてまとめて処理
    result += ((x+1)/2)*min(a,3*b)+(x/2)*min(b,3*a);

    //////////////////// 出力 ////////////////////

    cout << result << endl;
    
  }

  /////////////////// 後処理 ///////////////////



  //////////////////// 終了 ////////////////////

  return 0;

}