#include <bits/stdc++.h>
#include <atcoder/all>
using namespace std;
using namespace atcoder;

/////////////////// メイン ///////////////////

int main () {
  
  //////////////////// 入力 ////////////////////
  
  // 整数を2つ用意し、入力を受け取る
  int a, b;
  cin >> a >> b;

  //////////////// 出力変数定義 ////////////////

  // 1で初期化しておく
  int result = 1;

  //////////////////// 処理 ////////////////////

  // a+bが10以上だったら、答えを2に書き換える
  if (a+b>=10) {
    result = 2;
  } 

  //////////////////// 出力 ////////////////////

  cout << result << endl;

  //////////////////// 終了 ////////////////////

  return 0;

}