#include <bits/stdc++.h>
#include <atcoder/all>
using namespace std;
using namespace atcoder;

/////////////////// メイン ///////////////////

int main () {
  
  //////////////////// 入力 ////////////////////

  // 整数を2つ用意し、入力を受け取る
  int a, b;
  cin >> a >> b;

  //////////////// 出力変数定義 ////////////////

  // "No"で初期化することで、"Yes"のときに書き換えるだけで済むようにする
  string result = "No";

  //////////////////// 処理 ////////////////////

  // 整数で判定したいので、3a>2bかどうかを判定する
  if (3*a>2*b) result = "Yes";

  //////////////////// 出力 ////////////////////

  cout << result << endl;

  //////////////////// 終了 ////////////////////

  return 0;

}