#include <bits/stdc++.h>
#include <atcoder/all>
using namespace std;
using namespace atcoder;

/////////////////// メイン ///////////////////

int main () {
  
  //////////////////// 入力 ////////////////////

  // 文字列を用意し、入力を受け取る
  string s;
  cin >> s;

  // 文字数入力がないので、自分で作っておく
  int n = ssize(s);

  //////////////// 出力変数定義 ////////////////

  // sをそのまま使うので、なし

  //////////////////// 処理 ////////////////////

  // sを1文字ずつ見て、'A'以外なら'.'に変える
  for (int i=0; i<n; i++) {
    if (s.at(i)!='A') s.at(i) = '.';
  }

  //////////////////// 出力 ////////////////////

  cout << s << endl;

  //////////////////// 終了 ////////////////////

  return 0;

}