#include <bits/stdc++.h>
#include <atcoder/all>
using namespace std;
using namespace atcoder;

/////////////////// メイン ///////////////////

int main () {
  
  //////////////////// 入力 ////////////////////

  // 整数を2つ用意し、入力を受け取る
  int a, b;
  cin >> a >> b;

  //////////////// 出力変数定義 ////////////////

  // "Nein"で初期化することで、"Nine"のときに書き換えるだけで済むようにする
  string result = "Nein";

  //////////////////// 処理 ////////////////////

  // 「4つのうちのいずれかだったら」を || でつないで書く
  // 割り算だけ、商が9で余りが出る場合を誤判定しないように、a==9*b で判定する
  if (a+b==9||a-b==9||a*b==9||a==9*b) result = "Nine";

  //////////////////// 出力 ////////////////////

  cout << result << endl;

  //////////////////// 終了 ////////////////////

  return 0;

}