#include <bits/stdc++.h>
#include <atcoder/all>
using namespace std;
using namespace atcoder;

/////////////////// メイン ///////////////////

int main () {

  /////////////////// 前入力 ///////////////////

  int q;
  cin >> q;

  /////////////////// 前処理 ///////////////////



  /////////////////// ループ ///////////////////

  for (int loop=0; loop<q; loop++) {

    //////////////////// 入力 ////////////////////

    long long k;
    cin >> k;

    //////////////// 出力変数定義 ////////////////

    long long result = 0;

    //////////////////// 処理 ////////////////////

    // 100倍までを全探索する
    for (int i=1; i<=100; i++) {

      // とりあえずi倍した数を整数と文字列で作る
      long long num = k*i;
      string s = to_string(num);

      // 文字列の方で"00"が含まれていたら、その整数が答え
      if (s.contains("00")) {
        result = num;
        break;
      }

    }

    //////////////////// 出力 ////////////////////

    cout << result << endl;

  }

  /////////////////// 後処理 ///////////////////



  //////////////////// 終了 ////////////////////

  return 0;

}