#include <bits/stdc++.h>
#include <atcoder/all>
using namespace std;
using namespace atcoder;

/////////////////// メイン ///////////////////

int main () {

  /////////////////// 前入力 ///////////////////

  int q;
  cin >> q;

  /////////////////// 前処理 ///////////////////



  /////////////////// ループ ///////////////////

  for (int loop=0; loop<q; loop++) {

    //////////////////// 入力 ////////////////////

    long long n;
    cin >> n;

    //////////////// 出力変数定義 ////////////////

    long long result = 0;

    //////////////////// 処理 ////////////////////

    // とりあえず、正方形または縦横差1の長方形で、面積n以上の最小のものを作る
    long long h = sqrtl(n);
    if (h*h<n) h++;
    long long w = h-1;
    if (h*w<n) w++;

    // 各タイルの左辺と上辺を数えると全部で2*n本ある
    // そのうち隣接に使われない辺は合計h+w本なので、それを引く
    result = 2*n-h-w;

    //////////////////// 出力 ////////////////////

    cout << result << endl;

  }

  /////////////////// 後処理 ///////////////////



  //////////////////// 終了 ////////////////////

  return 0;

}