#include <bits/stdc++.h>
#include <atcoder/all>
using namespace std;
using namespace atcoder;

/////////////////// メイン ///////////////////

int main () {

  /////////////////// 前入力 ///////////////////

  int q;
  cin >> q;

  /////////////////// 前処理 ///////////////////



  /////////////////// ループ ///////////////////

  for (int loop=0; loop<q; loop++) {

    //////////////////// 入力 ////////////////////

    string s;
    cin >> s;

    //////////////// 出力変数定義 ////////////////

    int result = 0;

    //////////////////// 処理 ////////////////////

    // sを右から見ていったとき、残る予定の文字列（逆順）
    string t = "";

    // sを右から見る
    while (s!="") {

      // とりあえず、1文字をtの末尾に移植
      t += s.back();
      s.pop_back();

      // tの末尾が'A'だったら削除
      if (t.ends_with("A")) {
        t.pop_back();

        // その上で次が'B'だったらそれも削除
        if (t.ends_with("B")) {
          t.pop_back();

          // さらにその上で次が'C'だったらそれも削除
          if (t.ends_with("C")) {
            t.pop_back();
          }

        }

      }

    }

    // 最終的にtに入っていた文字数が答え
    result = t.size();

    //////////////////// 出力 ////////////////////

    cout << result << endl;

  }

  /////////////////// 後処理 ///////////////////



  //////////////////// 終了 ////////////////////

  return 0;

}