#include <bits/stdc++.h>
#include <atcoder/all>
using namespace std;
using namespace atcoder;

/////////////////// メイン ///////////////////

int main () {
  
  //////////////////// 入力 ////////////////////

  // 整数を2つ用意し、入力を受け取る
  int x, y;
  cin >> x >> y;

  //////////////// 出力変数定義 ////////////////

  // "No"で初期化することで、"Yes"のときに書き換えるだけで済むようにする
  string result = "No";

  //////////////////// 処理 ////////////////////

  // x:y = 16:9 であれば"Yes"
  // 小数は扱いたくないので、9x = 16y かどうかで判定する
  if (x*9==y*16) result = "Yes";

  //////////////////// 出力 ////////////////////

  cout << result << endl;

  //////////////////// 終了 ////////////////////

  return 0;

}