#include <bits/stdc++.h>
#include <atcoder/all>
using namespace std;
using namespace atcoder;

/////////////////// メイン ///////////////////

int main () {
  
  //////////////////// 入力 ////////////////////

  // 文字列を用意し、入力を受け取る
  string s;
  cin >> s;

  // 文字数を取得しておく
  int n = ssize(s);

  //////////////// 出力変数定義 ////////////////

  string result = "";

  //////////////////// 処理 ////////////////////

  // 1文字ずつ見ていくループ
  for (int i=0; i<n; i++) {

    // 見ている文字を結果に足す
    result += s.at(i);

    // 最後の文字でなければ、さらに'o'を足す
    if (i!=n-1) result += 'o';

  }

  //////////////////// 出力 ////////////////////

  cout << result << endl;

  //////////////////// 終了 ////////////////////

  return 0;

}