#include <bits/stdc++.h>
#include <atcoder/all>
using namespace std;
using namespace atcoder;

/////////////////// メイン ///////////////////

int main () {
  
  //////////////////// 入力 ////////////////////

  int n;
  string s;
  cin >> n >> s;

  //////////////// 出力変数定義 ////////////////

  int result = 0;

  //////////////////// 処理 ////////////////////

  // 番兵として、晴れの日を追加しておく
  s += 'S';

  // 連続雨の日記録
  int counter = 0;

  // 1日ずつデータを見る
  for (char c : s) {

    if (c=='S') {

      // 晴れの日の場合、今のカウンターの値を最大値候補として更新処理をし、カウンターリセット
      result = max(result,counter);
      counter = 0;

    } else {

      // 雨の日の場合、カウンターを1進める
      // 番兵をおいてあるので、更新処理は不要
      counter++;
      
    }

  }

  //////////////////// 出力 ////////////////////

  cout << result << endl;

  //////////////////// 終了 ////////////////////

  return 0;

}