#include <bits/stdc++.h>
#include <atcoder/all>
using namespace std;
using namespace atcoder;

/////////////////// メイン ///////////////////

int main () {
  
  //////////////////// 入力 ////////////////////

  // 文字列を用意し、入力を受け取る
  string s;
  cin >> s;

  //////////////// 出力変数定義 ////////////////

  // "East"で初期化することで、西軍の勝ちなら"West"に書き換えるだけでよくする
  string result = "East";

  //////////////////// 処理 ////////////////////

  // Wが出たら+1、Eが出たら-1するカウンター
  int counter = 0;

  // すべての文字を1文字ずつ見る
  for (char c : s) {

    // もしEだったら1減らし、そうじゃなかったら（つまりWだったら）1増やす
    if (c=='E') counter--;
    else counter++;

  }

  // 最終的にカウンターが+だったら、Wの方がたくさん出ているので答えを"West"に変える
  if (counter>0) result = "West";

  //////////////////// 出力 ////////////////////

  cout << result << endl;

  //////////////////// 終了 ////////////////////

  return 0;

}