#include <bits/stdc++.h>
#include <atcoder/all>
using namespace std;
using namespace atcoder;

/////////////////// メイン ///////////////////

int main () {

  /////////////////// 前入力 ///////////////////

  int q;
  cin >> q;

  /////////////////// 前処理 ///////////////////



  /////////////////// ループ ///////////////////

  for (int loop=0; loop<q; loop++) {

    //////////////////// 入力 ////////////////////

    int n;
    cin >> n;

    vector<int> a(n);
    for (int i=0; i<n; i++) {
      cin >> a.at(i);
    }

    //////////////// 出力変数定義 ////////////////

    int result = 0;

    //////////////////// 処理 ////////////////////

    // とりあえず、末尾が0以外だったら最低でも1回は必要というチェック
    // 末尾が0のときは、全部0のときは0それ以外なら今後の処理で対応される
    if (a.back()!=0) result = 1;

    // 末尾以外をチェック
    for (int i=0; i<n-1; i++) {

      // 次の数をkだけ減らすと、ここは2kか2k+1引かれる
      // つまり、この差がここで2k+1をやらなきゃいけない数
      // すなわち、最初の数として対応ビットが1である数を用意しなきゃいけない数
      int d = a.at(i)-2*a.at(i+1);

      // 回数指定が負だった場合、それは不可能
      if (d<0) {
        result = -1;
        break;
      }

      // 全箇所で求めたdおよび最初に用意した0または1、の最大値が答え
      result = max(result,d);

    }

    //////////////////// 出力 ////////////////////

    cout << result << endl;

  }

  /////////////////// 後処理 ///////////////////



  //////////////////// 終了 ////////////////////

  return 0;

}