#include <bits/stdc++.h>
#include <atcoder/all>
using namespace std;
using namespace atcoder;

/////////////////// メイン ///////////////////

int main () {

  /////////////////// 前入力 ///////////////////

  int q;
  cin >> q;

  /////////////////// 前処理 ///////////////////



  /////////////////// ループ ///////////////////

  for (int loop=0; loop<q; loop++) {

    //////////////////// 入力 ////////////////////

    int k;
    cin >> k;

    vector<int> a(k+1);
    for (int i=0; i<k+1; i++) {
      cin >> a.at(i);
    }

    //////////////// 出力変数定義 ////////////////

    string result = "Alice";

    //////////////////// 処理 ////////////////////

    // 最小値を調べて、kの倍数に切り捨て
    int m = *min_element(a.begin(),a.end());
    m = (m/k)*k;

    // 全ての山にm個残すとして、余剰分が何個あるか？
    long long sum = accumulate(a.begin(),a.end(),0LL) - 1LL*m*(k+1);

    // 余剰分をk個未満にして渡すことができるなら先手勝ち
    // 多い分には困らず、そもそもk個より少ないと困る
    if (sum<k) result = "Bob";

    //////////////////// 出力 ////////////////////

    cout << result << endl;

  }

  /////////////////// 後処理 ///////////////////



  //////////////////// 終了 ////////////////////

  return 0;

}