#include <bits/stdc++.h>
#include <atcoder/all>
using namespace std;
using namespace atcoder;

/////////////////// メイン ///////////////////

int main () {

  /////////////////// 前入力 ///////////////////

  int q;
  cin >> q;

  /////////////////// 前処理 ///////////////////



  /////////////////// ループ ///////////////////

  for (int loop=0; loop<q; loop++) {

    //////////////////// 入力 ////////////////////

    int n;
    cin >> n;

    vector<long long> a(n);
    for (int i=0; i<n; i++) {
      cin >> a.at(i);
    }

    //////////////// 出力変数定義 ////////////////

    long long result = 0;

    //////////////////// 処理 ////////////////////

    // とりあえずソートして解いてよい
    sort(a.begin(),a.end());

    // 最大と最小以外全部1回ずつ足す
    result = accumulate(a.begin()+1,a.end()-1,0LL);

    // 最小をn-2回足す
    result += a.at(0)*(n-2);

    // 最小3個ずつを、別のやつの2個目に変えることができる
    // それで安くなるなら貪欲に採用
    for (int i=1; i<(n-1)/3; i++) {
      if (a.at(i)<=a.at(0)*3) result += a.at(i)-a.at(0)*3;
    }

    // 3以下なら、表裏両方最小のカードを追加する必要がある
    if (n<=3) result += a.at(0)*2;

    //////////////////// 出力 ////////////////////

    cout << result << endl;

  }

  /////////////////// 後処理 ///////////////////



  //////////////////// 終了 ////////////////////

  return 0;

}