#include <bits/stdc++.h>
#include <atcoder/all>
using namespace std;
using namespace atcoder;

/////////////////// メイン ///////////////////

int main () {

  /////////////////// 前入力 ///////////////////

  int q;
  cin >> q;

  /////////////////// 前処理 ///////////////////



  /////////////////// ループ ///////////////////

  for (int loop=0; loop<q; loop++) {

    //////////////////// 入力 ////////////////////

    int n, m;
    cin >> n >> m;

    vector<long long> a(m);
    for (int i=0; i<m; i++) {
      cin >> a.at(i);
    }

    //////////////// 出力変数定義 ////////////////

    long long result = 0;

    //////////////////// 処理 ////////////////////

    // 今持っている 2^i サイズの袋の個数
    long long bag = 0;

    // 重い荷物から順にループ
    for (int i=m-1; i>=0; i--) {

      // 2^i サイズの袋が足りなければ、2^i サイズの袋n個セットを投入する
      // 高速化のため何セット投入するか求めてまとめて処理する
      // これを1セットにつき「袋サイズを 2^i 拡張した」と考える
      if (bag<a.at(i)) {
        long long num = (a.at(i)-bag+n-1)/n;
        result += (num<<i);
        bag += n*num;
      }

      // 2^i サイズの袋を必要なだけ消費
      bag -= a.at(i);

      // 2^(i-1) サイズの袋が 2 倍の個数余っていると考えて次へ
      bag *= 2;

    }

    //////////////////// 出力 ////////////////////

    cout << result << endl;

  }

  /////////////////// 後処理 ///////////////////



  //////////////////// 終了 ////////////////////

  return 0;

}