#include <bits/stdc++.h>
#include <atcoder/all>
using namespace std;
using namespace atcoder;

/////////////////// メイン ///////////////////

int main () {
  
  //////////////////// 入力 ////////////////////

  // 整数を2つ用意し、入力を受け取る
  int h, w;
  cin >> h >> w;

  //////////////// 出力変数定義 ////////////////

  // "No"で初期化することで、"Yes"のときに書き換えるだけで済むようにする
  string result = "No";

  //////////////////// 処理 ////////////////////

  // w÷(h/100)÷(h/100)>=25 だったら "Yes"
  // 小数の発生を回避して判定する
  if (w*10000>=25*h*h) result = "Yes";

  //////////////////// 出力 ////////////////////

  cout << result << endl;

  //////////////////// 終了 ////////////////////

  return 0;

}