#include <bits/stdc++.h>
#include <atcoder/all>
using namespace std;
using namespace atcoder;

/////////////////// メイン ///////////////////

int main () {
  
  //////////////////// 入力 ////////////////////

  // 整数とvectorを1つずつ用意し、入力を受け取る
  int n;
  cin >> n;

  vector<int> a(n);
  for (int i=0; i<n; i++) {
    cin >> a.at(i);
  }

  //////////////// 出力変数定義 ////////////////

  // 個数を数えるので、0で初期化しておく
  int result = 0;

  //////////////////// 処理 ////////////////////

  // ループで、最後の2つ以外を1つずつ調べる
  for (int i=0; i<n-2; i++) {

    // 問題通りの条件を満たしたら、1個とカウントする
    if (a.at(i)<a.at(i+1)&&a.at(i+1)>a.at(i+2)) result++;
    
  }

  //////////////////// 出力 ////////////////////

  cout << result << endl;

  //////////////////// 終了 ////////////////////

  return 0;

}