#include <bits/stdc++.h>
#include <atcoder/all>
using namespace std;
using namespace atcoder;

/////////////////// メイン ///////////////////

int main () {
  
  //////////////////// 入力 ////////////////////

  int n;
  string s;
  cin >> n >> s;

  //////////////// 出力変数定義 ////////////////

  int result = 0;

  //////////////////// 処理 ////////////////////

  // 以下の3つを全て満たす場所を探して全探索する
  // - 前が 'o' でない i==0||s.at(i-1)=='x'
  // - 自身が 'o' でない s.at(i)=='x'
  // - 後ろが 'o' でない i==n-1||s.at(i+1)=='x'
  for (int i=0; i<n; i++) {
    if ((i==0||s.at(i-1)=='x')&&s.at(i)=='x'&&(i==n-1||s.at(i+1)=='x')) result++;
  }

  //////////////////// 出力 ////////////////////

  cout << result << endl;

  //////////////////// 終了 ////////////////////

  return 0;

}